### Restart and Run All

In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()

pd.set_option('display.float_format','{:,.2f}'.format)
pd.set_option('display.max_rows',None)

year = 2023
quarter = 2

today = date.today()
today

datetime.date(2023, 5, 17)

In [2]:
sql = '''
SELECT name,year,quarter,q_amt 
FROM epss 
WHERE (year = %s AND quarter <= %s)
OR (year = %s-1 AND quarter >= %s+1) 
ORDER BY year DESC, quarter DESC'''
sql = sql % (year, quarter, year, quarter)
dfc = pd.read_sql(sql, conlt)
dfc['Counter'] = 1
dfc_grp = dfc.groupby(['name'], as_index=False).sum()
dfc_grp = dfc_grp[dfc_grp['Counter'] == 4]
dfc_grp

       name  year  quarter    q_amt  Counter
10      AOT  8090       10 -1336443        4
70      FPT  8090       10  2033577        4
80   GVREIT  8090       10   645471        4
123      MC  8090       10   847819        4
131   OISHI  8090       10  1187041        4
193   TFFIF  8090       10  1996055        4

In [3]:
sql = '''
SELECT name,year,quarter,q_amt 
FROM epss 
WHERE (year = %s AND quarter <= %s-1) 
OR (year = %s-1 AND quarter >= %s) 
ORDER BY year DESC, quarter DESC'''
sql = sql % (year, quarter, year, quarter)
print(sql)

SELECT name,year,quarter,q_amt
FROM epss
WHERE (year = 2023 AND quarter <= 2-1)
OR (year = 2023-1 AND quarter >= 2)
ORDER BY year DESC, quarter DESC

In [4]:
dfp = pd.read_sql(sql, conlt)
dfp['Counter'] = 1
dfp_grp = dfp.groupby(['name'], as_index=False).sum()
dfp_grp = dfp_grp[dfp_grp['Counter'] == 4]
dfp_grp.shape

(177, 5)

In [5]:
dfm = pd.merge(dfc_grp, dfp_grp, on='name', suffixes=(['_c','_p']), how='inner')
dfm['inc_profit'] = dfm['q_amt_c']-dfm['q_amt_p']
dfm['Pct'] = round(dfm['inc_profit']/abs(dfm['q_amt_p'])*100,2)
dfm['year'] = year
dfm['quarter'] = 'Q'+str(quarter)
df_pct = dfm[['name','year','quarter','q_amt_c','q_amt_p','inc_profit','Pct']]
df_pct

     name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
0     AOT  2023      Q2 -1336443 -6473437     5136994 79.35
1     FPT  2023      Q2  2033577  2029252        4325  0.21
2  GVREIT  2023      Q2   645471   643255        2216  0.34
3      MC  2023      Q2   847819   832309       15510  1.86
4   OISHI  2023      Q2  1187041  1126122       60919  5.41
5   TFFIF  2023      Q2  1996055  1921578       74477  3.88

In [6]:
sql = """
DELETE FROM qt_profits 
WHERE year = %s AND quarter = 'Q%s'"""
sql = sql % (year,quarter)
print(sql)

DELETE FROM qt_profits
WHERE year = 2023 AND quarter = 'Q2'

In [7]:
rp = conlt.execute(sql)
rp.rowcount

0

In [8]:
sql = 'SELECT name, id FROM tickers'
tickers = pd.read_sql(sql, conlt)
tickers.shape

(401, 2)

In [9]:
df_ins = pd.merge(df_pct, tickers, on='name', how='inner')
df_ins.dtypes

name           object
year            int64
quarter        object
q_amt_c         int64
q_amt_p         int64
inc_profit      int64
Pct           float64
id              int64
dtype: object

In [10]:
rcds = df_ins.values.tolist()
len(rcds)

6

In [11]:
for rcd in rcds:
    print(rcd)

['AOT', 2023, 'Q2', -1336443, -6473437, 5136994, 79.35, 24]
['FPT', 2023, 'Q2', 2033577, 2029252, 4325, 0.21, 746]
['GVREIT', 2023, 'Q2', 645471, 643255, 2216, 0.34, 654]
['MC', 2023, 'Q2', 847819, 832309, 15510, 1.86, 291]
['OISHI', 2023, 'Q2', 1187041, 1126122, 60919, 5.41, 338]
['TFFIF', 2023, 'Q2', 1996055, 1921578, 74477, 3.88, 686]

In [12]:
sql = """
INSERT INTO qt_profits (name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct, ticker_id) \
 VALUES (?, ?, ?, ?, ?, ?, ?, ?)"""
print(sql)

INSERT INTO qt_profits (name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct, ticker_id)  VALUES (?, ?, ?, ?, ?, ?, ?, ?)

In [13]:
for rcd in rcds:
    conlt.execute(sql, rcd)

### End of loop

In [14]:
cols = 'name year quarter q_amt_c q_amt_p inc_profit Pct'.split()

In [15]:
criteria_1 = df_ins.q_amt_c > 440000
df_ins.loc[criteria_1,cols].sort_values(['Pct'],ascending=[False]).head()

     name  year quarter  q_amt_c  q_amt_p  inc_profit  Pct
4   OISHI  2023      Q2  1187041  1126122       60919 5.41
5   TFFIF  2023      Q2  1996055  1921578       74477 3.88
3      MC  2023      Q2   847819   832309       15510 1.86
2  GVREIT  2023      Q2   645471   643255        2216 0.34
1     FPT  2023      Q2  2033577  2029252        4325 0.21

In [16]:
criteria_2 = df_ins.q_amt_p > 400000
df_ins.loc[criteria_2,cols].sort_values(['Pct'],ascending=[False]).head()

     name  year quarter  q_amt_c  q_amt_p  inc_profit  Pct
4   OISHI  2023      Q2  1187041  1126122       60919 5.41
5   TFFIF  2023      Q2  1996055  1921578       74477 3.88
3      MC  2023      Q2   847819   832309       15510 1.86
2  GVREIT  2023      Q2   645471   643255        2216 0.34
1     FPT  2023      Q2  2033577  2029252        4325 0.21

In [17]:
criteria_3 = df_ins.Pct > 10
df_ins.loc[criteria_3,cols].sort_values(['Pct'],ascending=[False]).head()

  name  year quarter  q_amt_c  q_amt_p  inc_profit   Pct
0  AOT  2023      Q2 -1336443 -6473437     5136994 79.35

In [18]:
df_ins_criteria = criteria_1 & criteria_2 & criteria_3
df_ins.loc[df_ins_criteria,cols].sort_values(['Pct'],ascending=[False]).head()

Empty DataFrame
Columns: [name, year, quarter, q_amt_c, q_amt_p, inc_profit, Pct]
Index: []